<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/2%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B011(0801).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
date_list=[{'yyyy-mm-dd':'2000-06-27'},
          {'yyyy-mm-dd':'2002-09-24'},
          {'yyyy-mm-dd':'2005-12-20'},]
df=pd.DataFrame(date_list,columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
def extract_year(column):
    return column.split("-")[0]#하나의 컬럼을 받았을 때 -를 기준으로 split, 첫번째 인자를 return 하라는 뜻

In [ ]:
df['year']=df['yyyy-mm-dd'].apply(extract_year)#각 row에 함수 하나씩을 적용하겠다는 의미. for문을 사용하지 않아도 같은 효과.

In [ ]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
#함수 안에 parameter을 어떻게 넣나?

In [ ]:
def get_age(year,current_year):
    return current_year-int(year)+1#강의와는 다르게 한국 나이 기준으로 하고싶어서 +1함

In [ ]:
df['age']=df['year'].apply(get_age,current_year=2020)#파라미터값을 줌

In [ ]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2002-09-24  2002   19
2  2005-12-20  2005   16

In [ ]:
def get_introduce(age,prefix,suffix):
    return prefix+str(age)+suffix#멀티플 파라미터 사용 가능

In [ ]:
df['introduce']=df['age'].apply(get_introduce,prefix="I am",suffix="years old")#I am+나이+years old가 introduce column으로 들어가도록 apply

In [ ]:
df

   yyyy-mm-dd  year  age        introduce
0  2000-06-27  2000   21  I am21years old
1  2002-09-24  2002   19  I am19years old
2  2005-12-20  2005   16  I am16years old

In [ ]:
#여러개의 column을 한 번에 apply 가능한가?

In [ ]:
def get_introduce_2(row):
    return "I was born in"+str(row.year)+" my age is"+str(row.age)#year과 age 두 개의 column

In [ ]:
df.introduce=df.apply(get_introduce_2,axis=1)#axis=1을 통해 row에 있는 모든 column 활용 가능/df.introduce==df['introduce']

In [ ]:
df

   yyyy-mm-dd  year  age                      introduce
0  2000-06-27  2000   21  I was born in2000 my age is21
1  2002-09-24  2002   19  I was born in2002 my age is19
2  2005-12-20  2005   16  I was born in2005 my age is16